# Project 1

## PART 2 – LISTS, DICTIONARIES AND LOOPING

In [38]:
# Create a List & Dictionary
cities= {
    'Nagoya' : {
         'Country' : 'Japan',
         'Population' : 123,
         'Landmarks': ['Nagoya Castle', 'Tokugawa Garden', 'Toyota Automobile Museum'],
         'Dishes' : ['Hitsumabushi', 'Tebasaki','Kishimen Udon'],
         },
    'Busan': {
         'Country' : 'South Korea',
         'Population' : 52,
         'Landmarks': ['Haeundae Beach', 'Gamcheon Culture Village', 'Busan Tower'] ,
         'Dishes' : ['Milmyeon', 'Eomuk', 'Jogae-gui'],
         },
    'Danang': {
         'Country' : 'Vietnam',
         'Population' : 105,
         'Landmarks': ['Dragon Bridge','Ba Na Hills', 'Marble Mountains'],
         'Dishes' : ['Mi Quang', 'Chicken Rice', 'Bun Cha Ca'],
         },
    'Bandung': {
         'Country' : 'Indonesia',
         'Population' : 281,
         'Landmarks': ['Kawah Putih', 'Tangkuban Perahu', 'Braga Street'],
         'Dishes' : ['Batagor', 'Nasi Timbel', 'Cireng'],
         },
    'Taipei': {
         'Country' : 'Taiwan',
         'Population' : 23,
         'Landmarks': ['Taipei 101', 'Shilin Night Market', 'Jiufen'],
         'Dishes' : ['Beef Noodle Soup', 'Bubble Tea', 'Scalion Pancake'],
         }
}

In [48]:
# Use Loops to print name, country, population, landmarks & dishes
print("Cities that I would like to visit:")
for city, info in cities.items():
    country = info['Country'].title()
    population = info['Population']

    print(f"\nCity : {city.title()}")
    print(f"Country : {country}")
    print(f"Population: {population} million")

    print("3 Famous Landmarks:")
    for x in info["Landmarks"]:
        print(f"- {x}")

    print("3 Popular Local Dishes:")
    for x in info["Dishes"]:
        print(f"- {x}")

Cities that I would like to visit:

City : Nagoya
Country : Japan
Population: 123 million
3 Famous Landmarks:
- Nagoya Castle
- Tokugawa Garden
- Toyota Automobile Museum
3 Popular Local Dishes:
- Hitsumabushi
- Tebasaki
- Kishimen Udon

City : Busan
Country : South Korea
Population: 52 million
3 Famous Landmarks:
- Haeundae Beach
- Gamcheon Culture Village
- Busan Tower
3 Popular Local Dishes:
- Milmyeon
- Eomuk
- Jogae-gui

City : Danang
Country : Vietnam
Population: 105 million
3 Famous Landmarks:
- Dragon Bridge
- Ba Na Hills
- Marble Mountains
3 Popular Local Dishes:
- Mi Quang
- Chicken Rice
- Bun Cha Ca

City : Bandung
Country : Indonesia
Population: 281 million
3 Famous Landmarks:
- Kawah Putih
- Tangkuban Perahu
- Braga Street
3 Popular Local Dishes:
- Batagor
- Nasi Timbel
- Cireng

City : Taipei
Country : Taiwan
Population: 23 million
3 Famous Landmarks:
- Taipei 101
- Shilin Night Market
- Jiufen
3 Popular Local Dishes:
- Beef Noodle Soup
- Bubble Tea
- Scalion Pancake

In [4]:
class Person:
  def __init__(self, name, age):
    self.name = name
    self.age = age

p1 = Person("Linus", 28)
p2 = Person("Jae", 33)
print(p1.name, p2.age)
print(p2.age, p2.name)

Linus 33
33 Jae

PART 4 – FILES AND EXCEPTIONS

PART 5 – NUMPY

In [54]:
import numpy as np
import pandas as pd

In [55]:
#Create 2 array of each size

rng = np.random.RandomState(15)

# Single 1d array
A = pd.DataFrame(rng.randint(0, 50,1))
B = pd.DataFrame(rng.randint(0, 50,1))

# 3x3 array
C = pd.DataFrame(rng.randint(0, 50,(3,3)))
D = pd.DataFrame(rng.randint(0, 50,(3,3)))

# 2x4 array
E = pd.DataFrame(rng.randint(0, 50,(2,4)))
F = pd.DataFrame(rng.randint(0, 50,(2,4)))

# 4x2 array
G = pd.DataFrame(rng.randint(0, 50,(4,2)))
H = pd.DataFrame(rng.randint(0, 50,(4,2)))

# 5x5 array
I = pd.DataFrame(rng.randint(0, 50,(5,5)))
J = pd.DataFrame(rng.randint(0, 50,(5,5)))

In [56]:
print("Single 1D Array A:\n", A)
print("\nSingle 1D Array B:\n", B)
print("\n3x3 Array C:\n", C)
print("\n3x3 Array D:\n", D)
print("\n2x4 Array E:\n", E)
print("\n2x4 Array F:\n", F)
print("\n4x2 Array G:\n", G)
print("\n4x2 Array H:\n", H)
print("\n5x5 Array I:\n", I)
print("\n5x5 Array J:\n", J)

Single 1D Array A:
    0
0  8

Single 1D Array B:
     0
0  12

3x3 Array C:
     0   1   2
0   5   0  28
1  27   7  11
2  21  47  29

3x3 Array D:
     0   1   2
0  17  45  31
1  23  32  10
2  15   4  41

2x4 Array E:
     0   1   2   3
0  39  37  19  44
1  13  29  15  38

2x4 Array F:
     0   1   2   3
0  15  49   1  31
1  32  21  26  34

4x2 Array G:
     0   1
0  11   1
1  40   6
2  41  34
3  40  22

4x2 Array H:
     0   1
0  40  15
1  28  35
2   4   7
3   2  42

5x5 Array I:
     0   1   2   3   4
0  32  37   7  24  37
1  45  19  49  48  40
2  29  12  24  46  12
3  33   2  24  44  42
4  17  23  29  34  23

5x5 Array J:
     0   1   2   3   4
0  18  26  26  16  13
1  26  32   6   4  28
2  20  35  39  28   5
3   0   9  48  20  46
4  38  35  14  18  39

# Using numpy library: perform at least twenty (20) functions from Table 4-3, Table 4-4, Table 4-5 and Table 4-7 from Python for Data Analysis book.

## Table 4-3

Perform operation on single array

In [57]:
sqrt = A**0.5
sqrt

          0
0  2.828427

In [58]:
square = B**2
square

     0
0  144

Perform operation on two arrays of same size (eg. multiplication, etc.)

In [61]:
addition = C + D
addition

    0   1   2
0  22  45  59
1  50  39  21
2  36  51  70

In [45]:
subtraction = E - F
subtraction

    0   1   2   3
0  24 -12  18  13
1 -19   8 -11   4

In [46]:
multiplication = G * H
multiplication

      0    1
0   440   15
1  1120  210
2   164  238
3    80  924

In [48]:
# element-wise division of DataFrames J by I
divide = J / I

# display the division result
divide

# compute column-wise means using pandas (avoid calling undefined mean)
divide_means = divide.mean()
divide_means

          0         1         2         3         4
0  0.562500  0.702703  3.714286  0.666667  0.351351
1  0.577778  1.684211  0.122449  0.083333  0.700000
2  0.689655  2.916667  1.625000  0.608696  0.416667
3  0.000000  4.500000  2.000000  0.454545  1.095238
4  2.235294  1.521739  0.482759  0.529412  1.695652